Revit 2024 API
ContourSetting Members
The ContourSetting type exposes the following members.
Methods
Name | Description
AddContourRange
 Add a set of contours as a contour setting item to the current contour setting.
AddSingleContour
 Add a single contour as a contour setting item to the current contour setting.
DisableItem
 Disable a contour setting item of the current contour setting so that the item will not be used to draw contours.
Dispose
Releases all resources used by the ContourSetting
EnableItem
 Enable a contour setting item of the current contour setting so that the item will be used to draw contours.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetContourSettingItems
 Get all contour setting items.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetItemIndex
 Get the index of a contour setting item of the current contour setting
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RemoveItem
 Remove a contour setting item from the current contour setting.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ContourSetting Class
Autodesk.Revit.DB Namespace